bryamzxz/tinylink/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2026 Bryam (bryamzxz)
#
# tinylink default sdkconfig — common to all ESP32 variants.
# Per-target overrides live in sdkconfig.defaults.<target>.
#
# Hardening + tuning baseline for ESP-IDF v5.5.x.

# ---- Target / flash / partition table ----------------------------------------
# partitions.csv places ota_1 at 0x320000 + a 0x4000 nvs_creds region, so flash
# must be ≥ 4 MB (ESP32-WROOM-32E and friends ship with 4 MB).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# QIO@80MHz is within the WROOM-32E datasheet Table 17 spec
# ("FC Maximum clock frequency = 80 MHz, guaranteed through design
# and/or characterization") — the integrated flash + module layout
# are pre-characterized by Espressif for this configuration, so no
# soak test is required for this specific module.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- WiFi tuning (single-STA, low memory) ------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
# Station-only build: tinylink never runs as an AP (no WIFI_MODE_AP,
# no esp_wifi_set_mode(WIFI_MODE_AP), no softap_start call site).
# Drops the entire AP-side code path: beacon scheduler, AID table,
# DTIM management on AP side, AP-side WPS handshake, AP-side WPA
# supplicant fragment.
# CONFIG_ESP_WIFI_SOFTAP_SUPPORT is not set
# WPA3-Personal (SAE) handshake codepath: not needed; the production
# AP (INTELCOM-CARDONA) is WPA2-PSK-SHA256 + PMF, not WPA3-Personal.
# Removes SAE-PWE Dragonfly + SAE-H2E variants.
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
# WPA3-OWE-STA (Opportunistic Wireless Encryption for open networks).
# tinylink never associates to open APs; the production AP is WPA2.
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set

# ---- Power management --------------------------------------------------------
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# main.c::configure_pm() (called AFTER WiFi associates) sets
# light_sleep_enable=true, max=240, min=80. That call is what unlocks
# PM_MODE_LIGHT_SLEEP in pm_impl.c:561 — without it, tickless idle never
# enters light sleep at all.
#
# ESP_WIFI_SLP_IRAM_OPT and ESP_WIFI_SLP_BEACON_LOST_OPT are documented
# as the "always-on station" pair, but with WPA2-PSK + PMF on
# INTELCOM-CARDONA they break initial association — the AP kicks the
# client between AUTH-ASSOC handshake and DHCP. Verified empirically:
# enabling SLP_IRAM_OPT alone (which auto-selects PM_SLP_DEFAULT_PARAMS_OPT)
# is enough to reproduce the disconnect-retry-loop seen in the previous
# perf round. Stay disabled until we have an A/B against a less PMF-strict
# AP, or until IDF documents the actual interaction.

# ---- mbedTLS minimal config (TLS + crypto for ts2021/DERP) -------------------
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
# Heap budget for two simultaneous TLS conns (long-poll + DERP
# supervisor). Pinning rationale, item-by-item:
#
# 1. DYNAMIC_BUFFER=y + SESSION_TICKETS=n. Verified on-device 2026-05-06.
#
# History: PR #20 (512f772) experimented with DYNAMIC_BUFFER=y and a
# 2026-05-02 incident reported mid-write heap corruption, after which
# the flag was reverted. The followup notes attributed it ambiguously
# to either DYNAMIC_BUFFER itself or the (DYNAMIC_BUFFER + tickets)
# combination plus IDF bug PR #14614 / IDFGH-13752 (heap corruption
# when DYNAMIC_BUFFER + IN_CONTENT_LEN<16384) and #15984 (TLS 1.3
# panics with DYNAMIC_BUFFER on).
#
# This sprint isolated the variables: DYNAMIC_BUFFER=y with
# SESSION_TICKETS=n through 5+ minutes of steady-state long-poll
# (full handshake on every reconnect, no ticket resumption) plus
# 70+ telemetry tx in a row, zero corruption, zero alloc fails,
# zero stream ends. IN_CONTENT_LEN stays at 16384 so #14614 does
# not apply. #15984 was historically a TLS 1.3 panic on connect;
# our tinylink-→Tailscale TLS path negotiates 1.3 and connects
# cleanly here, so either the IDF fix landed in v5.5.4 or our
# ciphersuite/extension set sidesteps the trigger.
#
# Heap effect: at supervisor-connect time (post-bringup, post-WG)
# largest_block went from 7.4 KiB → 11.8 KiB (+4.4 KiB). Still
# below the 12 KiB peak mbedtls cert verify needs for the second
# TLS conn, so SUPERVISED=y still doesn't connect on first try
# without further work — that's a separate PR (supervisor task
# restructure to retry until heap allows).
#
# Trade-off vs SESSION_TICKETS=y: each long-poll reconnect now does
# a full TLS handshake (cert chain verify, RSA signature) instead
# of resuming via NewSessionTicket. ~10 KiB transient peak instead
# of ~4 KiB transient peak. Acceptable because the steady-state
# heap budget freed by DYNAMIC_BUFFER=y outweighs the per-reconnect
# cost on this ESP32-WROOM-32E target.
#
# 2. IN_CONTENT_LEN stays at 16384. Go's crypto/tls (what
#    controlplane.tailscale.com runs) emits TLS records up to 16384
#    plaintext regardless of the application layer's frame sizes.
#    Lowering IN below 16384 would surface as record_overflow alerts
#    on a large keepalive or the first MapResponse. Also keeps us
#    out of IDF bug PR #14614 / IDFGH-13752 (heap corruption when
#    DYNAMIC_BUFFER + IN_CONTENT_LEN<16384).
# 3. OUT_CONTENT_LEN at 2048 (down from 4096). tinylink emits short
#    frames in both directions: MapRequest ~500 B-2 KiB, DERP
#    frames <1500 B WG packets. Saves 2 KiB per conn × 2 conns.
# 4. KEEP_PEER_CERTIFICATE off. Saves ~2 KiB per conn; we don't
#    introspect certs after verify.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=n
# Tinylink never calls mbedtls_strerror() — error reporting goes through
# ESP_LOG with the hex error code only. Dropping the string lookup saves
# the ~8 KiB table that maps each MBEDTLS_ERR_* enum to its human name.
# Field-debug an mbedtls error by grepping include/mbedtls/error.h with
# the printed hex value.
# CONFIG_MBEDTLS_ERROR_STRINGS is not set

# ---- mbedTLS ECP curves — trim to {P-256, P-384, Curve25519} ----------------
# Tailscale's controlplane.tailscale.com is currently fronted by Let's
# Encrypt's E8 intermediate. Verified 2026-05-12 via
#   openssl s_client -connect controlplane.tailscale.com:443 \
#     -servername controlplane.tailscale.com -showcerts
#
# Leaf cert:  public key = P-256 (prime256v1),
#             signed with ecdsa-with-SHA384 by issuer "Let's Encrypt E8"
# Issuer E8:  public key = P-384 (secp384r1),
#             signed with ecdsa-with-SHA384 by ISRG Root X2 (also P-384)
#
# So we MUST keep P-256 (leaf key) AND P-384 (intermediate + root key) to
# validate the chain. Hash side is covered by CONFIG_MBEDTLS_SHA512_C=y
# (provides SHA-384). DERP TLS endpoints (derp1.tailscale.com etc.) sit
# behind the same LE E8 issuer chain, so this set serves both.
#
# Initial attempt on this branch trimmed P-384 too, which broke the
# handshake with mbedtls_ssl_handshake = -0x3A00 (X509_CERT_VERIFY_FAILED)
# against BOTH controlplane and derp1 — fail-loud at boot, no silent
# regression. P-384 stays on. Re-audit if Tailscale ever rotates to a
# different LE chain (E5/E6 are P-256, but the upstream root behind those
# is still P-384 ISRG X2 today).
#
# Curve25519 stays on too — costs ~78 B (ecp_mod_p255) and a few tables,
# keeps mbedTLS's X25519 KEM path warm for any future TLS 1.3 enablement
# (currently MBEDTLS_SSL_PROTO_TLS1_3 is off, so this is a hedge). Noise
# IK + WireGuard use the vendored donna X25519 in crypto/curve25519*.c
# independently of this Kconfig.
#
# Dropped curves (8): SECP192R1, SECP224R1, SECP521R1, the three Koblitz
# (SECP192K1, SECP224K1, SECP256K1), and the three Brainpool (BP256R1,
# BP384R1, BP512R1). Confirmed pre-trim via xtensa-esp32-elf-nm that
# these consumed `ecp_mod_p<bits>` helpers (~78-610 B each) plus per-
# curve `<curve>_p/_n/_gx/_gy/_b/_a` rodata tables (48-68 B × 6 per
# curve) ≈ 5-7 KiB across all eight.
# CONFIG_MBEDTLS_ECP_DP_SECP192R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP224R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED is not set

# ---- lwIP tunings ------------------------------------------------------------
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n
CONFIG_LWIP_TCP_SACK_OUT=n
CONFIG_LWIP_TCP_MSS=1440
# IPv4-only build: every socket in the firmware (WG UDP, esp_tls to
# controlplane.tailscale.com, DERP, STUN, telemetry) uses AF_INET. Disabling
# IPv6 recovers ~7 KiB RAM + ~39 KiB flash and shrinks the dual-stack
# attack surface.
CONFIG_LWIP_IPV6=n
# WireGuard sets its tunnel MTU to fit inside the outer UDP without IP
# fragmentation, and nothing on the outer side needs frag/reassembly.
# Reassembly is already off by IDF default; we pin both explicitly so
# regressions are caught at config-time. Removes a classic teardrop /
# overlap DoS surface on inbound packets. Safe because all outbound
# paths (WG UDP, TLS) fit under the link MTU.
CONFIG_LWIP_IP4_FRAG=n
CONFIG_LWIP_IP4_REASSEMBLY=n

# PPP support disabled — the WG tunnel netif now uses a custom no-op
# netstack defined in wg_lwip.c::s_wg_netstack_config (lines 178-184),
# landed in commit 4a915df ("feat/wg-netif-without-is-ppp"). Pre-Build-C
# we needed ESP_NETIF_NETSTACK_DEFAULT_PPP as the base template (forcing
# CONFIG_LWIP_PPP_SUPPORT=y), but the custom netstack now provides the
# raw-IP init_fn + stub input_fn directly without depending on the PPP
# module. Turning PPP off recovers ~10-20 KiB flash (ipcp_nakci,
# vj_compress_tcp, ppp_pcb, LCP/PAP/CHAP FSM, HDLC framing — all
# verified inalcanzables in the post-4a915df build via xtensa-esp32-elf-nm).
# CONFIG_LWIP_PPP_SUPPORT is not set

# ---- VFS trim ----------------------------------------------------------------
# Tinylink doesn't open files (no SD/SPIFFS/FAT), doesn't iterate
# directories (no readdir/opendir), and doesn't talk to the console
# beyond raw `printf` via UART. Keeping SELECT on because lwIP's user
# code may call select() on sockets; keeping IO on because newlib stdout
# routes through it.
# CONFIG_VFS_SUPPORT_TERMIOS is not set
# CONFIG_VFS_SUPPORT_DIR is not set

# ---- NVS encryption ----------------------------------------------------------
CONFIG_NVS_ENCRYPTION=y

# ---- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# Production bootloader: no UART chatter (`ets Jul 29 2019…`, partition
# table dump, `boot:` lines, `esp_image:` segments). The bootloader
# still runs the same code; only the log prints are compiled out via
# Kconfig. Recovery on a stuck boot is still possible by re-flashing
# with a "diag" overlay that flips this back to INFO. Saves ~3 KiB in
# the bootloader binary slot (no impact on app slot).
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

# ---- FreeRTOS ----------------------------------------------------------------
# HZ=100 (10 ms tick granularity) reduces tick-ISR overhead vs the IDF
# default 1000 (1 ms ticks) and lets tickless idle skip larger blocks
# at once. Audited 2026-05-10: every pdMS_TO_TICKS(N) callsite in tinylink
# uses N >= 100 ms, so no delay round-trips to 0 ticks. No bare integer
# tick arguments to vTaskDelay / xQueue* / xSemaphoreTake in our code.
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ---- IRAM-to-flash placement (production trim) -------------------------------
# ESP32-WROOM-32E has only 128 KiB IRAM total; the post-η firmware was
# at 80% IRAM (104 KiB used, 27 KiB free). These three knobs move
# never-from-ISR code paths out of IRAM and into flash-XIP. Real-time
# behaviour is unchanged because none of these functions are reachable
# while flash is suspended (auto-suspend disabled in tinylink) or from
# cache-disabled ISRs (we have no such ISR). Documented cost: WiFi
# RX throughput drops a few percent because every RX packet now incurs
# a flash cache miss on its first call. Tinylink's load (1 Hz
# telemetry + ~6/min long-poll inbound + WG handshake every ~85 s) is
# 3 orders of magnitude below the WiFi ceiling, so the throughput
# hit is invisible.

# WiFi RX path: the biggest single IRAM mover (~15 KiB).
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# FreeRTOS scheduler hot path: moves vTaskSwitchContext / xQueue*
# helpers / xSemaphore* into flash. Safe because we never call them
# from a cache-disabled ISR.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
# RingBuffer helpers: tinylink doesn't have an ISR producer/consumer
# for any RingBuffer.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
# newlib lock helpers (`__retarget_lock_*`): only need to be in IRAM
# if newlib state is mutated from a cache-disabled ISR, which tinylink
# does not do (no SPI_FLASH_AUTO_SUSPEND, no IRAM_ATTR newlib touch).
# CONFIG_LIBC_LOCKS_PLACE_IN_IRAM is not set

# ---- TLS to control plane ----------------------------------------------------
# tinylink talks ts2021 over TLS to controlplane.tailscale.com. We use
# esp_tls on top of mbedtls and verify against the IDF certificate bundle.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_POLY1305_C=y

# ---- App task stacks ---------------------------------------------------------
# Bigger main stack: TLS + Noise IK + JSON construction is much heavier than
# the M1-WG bringup that this replaces. Verified on-device 2026-05-02:
# the boot-time mbedtls cert-chain verification + ECDSA + Noise IK init
# in tinylink_register peaks at ~14 KiB; bumped from 16 K to 24 K to give
# margin. The long-poll task in tinylink.c::tinylink_long_poll_start
# also xTaskCreate's at 24 KiB to absorb the same workload — bug from
# 8 K manifested as random LoadProhibited / Double exception / fake
# heap-corruption asserts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# esp_timer dispatch task stack. mbedtls / lwIP timer callbacks (e.g.
# session ticket lifetime, sntp, peer-cert cleanup) routed through here
# blow past the 3584-byte default once TLS to controlplane.tailscale.com
# is up. Observed on first HW boot 2026-05-02: panic with EXCCAUSE 0x1c
# (LoadStoreError) immediately after the control-key fetch path,
# classic stack-overflow corruption. 6144 gives ~2x headroom.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# ---- Production: silent error paths ------------------------------------------
# Asserts still abort (level=1) but don't print the message string + __FILE__
# + __LINE__. Same crash safety, ~10 KiB flash saved across the error-handling
# surface. Re-enable (=2) in a "diag" overlay if field-debugging a panic.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# ESP_RETURN_ON_ERROR / ESP_GOTO_ON_ERROR drop their format-string parameter
# when CHECKS_SILENT=y. The check still triggers the goto/return; only the
# log line on error is elided.
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
# Drops the ~7 KiB esp_err_msg_table[] rodata; esp_err_to_name() returns
# "UNKNOWN ERROR" plus the hex code. Operationally readable, just lookup-free.
# CONFIG_ESP_ERR_TO_NAME_LOOKUP is not set
